<template>
  <div>
    <header-block />
    <div class="subscription">
      <div class="container">
        <ul class="breadcrumb">
          <li class="breadcrumb__back">
            <b-link @click="$router.go(-1)">
              <svg
                  width="14"
                  height="14"
                  viewBox="0 0 14 14"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
              >
                <path
                    fill-rule="evenodd"
                    clip-rule="evenodd"
                    d="M7.4128 2.5042C7.64061 2.732 7.64061 3.10135 7.4128 3.32916L4.32528 6.41668H11.0837C11.4058 6.41668 11.667 6.67784 11.667 7.00001C11.667 7.32218 11.4058 7.58334 11.0837 7.58334H4.32528L7.4128 10.6709C7.64061 10.8987 7.64061 11.268 7.4128 11.4958C7.185 11.7236 6.81565 11.7236 6.58785 11.4958L2.50451 7.41249C2.44859 7.35656 2.40639 7.2921 2.37792 7.2233C2.35054 7.15726 2.33493 7.08509 2.33373 7.00943M2.37792 6.77672C2.40639 6.70792 2.44859 6.64346 2.50451 6.58753L6.58785 2.5042C6.81565 2.27639 7.185 2.27639 7.4128 2.5042M2.37792 6.77672C2.35053 6.84276 2.33493 6.91493 2.33373 6.99059L2.37792 6.77672Z"
                    fill="#7F7F7F"
                />
                <mask
                    id="mask0_1354_96536"
                    style="mask-type:alpha"
                    maskUnits="userSpaceOnUse"
                    x="2"
                    y="2"
                    width="10"
                    height="10"
                >
                  <path
                      fill-rule="evenodd"
                      clip-rule="evenodd"
                      d="M7.4128 2.5042C7.64061 2.732 7.64061 3.10135 7.4128 3.32916L4.32528 6.41668H11.0837C11.4058 6.41668 11.667 6.67784 11.667 7.00001C11.667 7.32218 11.4058 7.58334 11.0837 7.58334H4.32528L7.4128 10.6709C7.64061 10.8987 7.64061 11.268 7.4128 11.4958C7.185 11.7236 6.81565 11.7236 6.58785 11.4958L2.50451 7.41249C2.44859 7.35656 2.40639 7.2921 2.37792 7.2233C2.35054 7.15726 2.33493 7.08509 2.33373 7.00943M2.37792 6.77672C2.40639 6.70792 2.44859 6.64346 2.50451 6.58753L6.58785 2.5042C6.81565 2.27639 7.185 2.27639 7.4128 2.5042M2.37792 6.77672C2.35053 6.84276 2.33493 6.91493 2.33373 6.99059L2.37792 6.77672Z"
                      fill="white"
                  />
                </mask>
                <g mask="url(#mask0_1354_96536)">
                  <rect
                      width="14"
                      height="14"
                      transform="matrix(-1 0 0 1 14 0)"
                      fill="#7F7F7F"
                  />
                </g>
              </svg>
              Назад
            </b-link>
          </li>
          <li>
            <b-link
              :to="{name: 'index'}"
            >
              Главная
            </b-link>
          </li>
          <li>
            <a href="#">
              Контакты
            </a>
          </li>
        </ul>
        <div class="subscription-inner">
          <h1>Контакты</h1>
          <div class="contacts-wrapper">
            <div class="contacts-left">
              <div class="contacts-blocks">
                <div class="contacts-block">
                  <p class="contacts-block__title">
                    Адрес
                  </p>
                  <p class="contacts-block__text">
                    МОО ОЗПП Триумф 119034, Москва, ул. Покровка, д. 29
                  </p>
                </div>
                <div class="contacts-block">
                  <p class="contacts-block__title">
                    Телефон
                  </p>
                  <a
                    href="tel:+74952910150"
                    class="contacts-block__text"
                  >
                    +7 495 291-01-50
                  </a>
                  <a
                    href="tel:+79036183494"
                    class="contacts-block__text"
                  >
                    +7 903 618-34-94
                  </a>
                </div>
                <div class="contacts-block">
                  <p class="contacts-block__title">
                    E-mail
                  </p>
                  <a
                    href="mailto:6458027@gmail.com"
                    class="contacts-block__text"
                  >
                    6458027@gmail.com
                  </a>
                </div>
              </div>
              <div class="contacts-socials">
                <a
                  href="#"
                  class="footer-social"
                >
                  <svg
                    width="33"
                    height="32"
                    viewBox="0 0 33 32"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M29.5629 9.33312H25.1756C24.9965 9.33312 24.8208 9.38167 24.6671 9.4736C24.5135 9.56554 24.3876 9.69741 24.3029 9.8552C24.3029 9.8552 22.5531 13.0778 21.991 14.1632C20.4789 17.0831 19.4998 16.1665 19.4998 14.8113V10.1387C19.4998 9.74822 19.3446 9.37376 19.0686 9.09766C18.7925 8.82156 18.418 8.66645 18.0275 8.66645H14.7289C14.2796 8.63305 13.8293 8.71505 13.4207 8.90466C13.0121 9.09426 12.6587 9.38518 12.3942 9.74979C12.3942 9.74979 14.0692 9.47896 14.0692 11.7359C14.0692 12.2955 14.098 13.9055 14.1243 15.2559C14.1293 15.4549 14.073 15.6506 13.9632 15.8166C13.8534 15.9826 13.6953 16.111 13.5102 16.1843C13.3252 16.2576 13.1221 16.2724 12.9284 16.2266C12.7346 16.1808 12.5596 16.0767 12.427 15.9283C11.0768 14.0504 9.95836 12.0163 9.09604 9.87019C9.02198 9.70964 8.90343 9.57371 8.75444 9.47852C8.60546 9.38333 8.43229 9.33286 8.25549 9.33312C7.30402 9.33312 5.40005 9.33312 4.26934 9.33312C4.1597 9.33237 4.05151 9.35826 3.95408 9.40855C3.85664 9.45884 3.77287 9.53203 3.70997 9.62184C3.64706 9.71164 3.60689 9.81538 3.59292 9.92414C3.57895 10.0329 3.59159 10.1434 3.62976 10.2462C4.84014 13.5663 10.0541 23.9998 16.0053 23.9998H18.5102C18.7726 23.9998 19.0243 23.8955 19.2099 23.7099C19.3955 23.5244 19.4998 23.2727 19.4998 23.0102V21.4977C19.4998 21.3079 19.5553 21.1223 19.6595 20.9638C19.7636 20.8052 19.9119 20.6805 20.0861 20.6052C20.2602 20.5299 20.4526 20.5071 20.6395 20.5398C20.8264 20.5725 20.9997 20.6591 21.138 20.789L24.1361 23.6059C24.4054 23.8589 24.761 23.9998 25.1304 23.9998H29.0675C30.9664 23.9998 30.9664 22.6821 29.9311 21.6625C29.2025 20.945 26.5733 18.1737 26.5733 18.1737C26.3482 17.9404 26.2139 17.6344 26.1947 17.3107C26.1756 16.9871 26.2728 16.6673 26.4688 16.4091C27.3187 15.2908 28.7087 13.4601 29.2982 12.6759C30.1039 11.604 31.5623 9.33312 29.5629 9.33312Z"
                      fill="#373737"
                    />
                  </svg>
                </a>
              </div>
            </div>
            <div class="contacts-map">
              <iframe src="https://www.google.com/maps/embed?pb=!1m14!1m8!1m3!1d8979.520380083135!2d37.6485692!3d55.7605851!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x0%3A0x293ba8cbeeebb3a3!2sMoo%20Ozpp%20%22Triumf%22!5e0!3m2!1sen!2sru!4v1659894200945!5m2!1sen!2sru" style="border:0;" allowfullscreen="" loading="lazy" referrerpolicy="no-referrer-when-downgrade"></iframe>
            </div>
          </div>
        </div>
      </div>
    </div>
    <footer-block />
  </div>
</template>

<script>
import { BLink } from 'bootstrap-vue'
import HeaderBlock from '../layouts/components/header-block/HeaderBlock.vue'
import FooterBlock from '../layouts/components/footer-block/FooterBlock.vue'

export default {
  components: {
    FooterBlock,
    HeaderBlock,
    BLink,
  },
}
</script>

<style scoped>
</style>
